from functools import reduce
import random

# 1. Пользователь вводит число, Вам необходимо вывести число Пи с той точностью знаков после запятой, 
#сколько указал пользователь(БЕЗ ИСПОЛЬЗОВАНИЯ МОДУЛЕЙ/БИБЛИОТЕК)

#n = int(input('Введите число: '))

#Pi = sum(1/16**x*(4/(8*x + 1) - 2/(8*x + 4) - 1/(8*x + 5) - 1/(8*x + 6)) for x in range(n))
#print(round(Pi, n))

#__________________________________________________________________________________________________

#2. Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.



#n = int(input('Задайте натуральное число: '))

#def a(n):
#    lst=[]
#    for i in range(2, n + 1):
#        for j in lst:
#            if i % j == 0:
#                break
#        else:
#            lst.append(i)
#    return lst

#def mul(a, b):
#    return a * b

#flag = True
#lst = []

#summ = n

#d = a(n)

#while flag:
#    if summ == 1:
#        flag = False
#    else:
#        for i in d:
#            if summ % i == 0:
#                lst.append(i)
#                summ /= i
#                continue
                
#print(lst) # список простах множетелей числа n
#print(reduce(mul,lst))


#__________________________________________________________________________________________________________________________

# 3. Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.

#arr, new_arr = [random.randint(1,10) for i in range(10)], list()
#print(arr)
#for i in range(len(arr)):
#     if arr.count(arr[i]) == 1: new_arr.append(arr[i])
#print(new_arr)


#______________________________________________________________________________________________________________________________________________________

# 4. Задана натуральная степень k. Сформировать случайным образом список коэффициентов (значения от 0 до 100) многочлена и записать в файл многочлен степени k.

#Пример:
#- k=2 => 2*x² + 4*x + 5 = 0 или x² + 5 = 0 или 10*x² = 0



#k = int(input("Введите число: "))

#while k >= 0:
#      num = random.randint(0, 101)
#      if num == 0 and k == 0: print(" = 0")
#      elif num == 0:
#          k -= 1
#          continue
#      if k == 0: print(f"{num} = 0")
#      elif k == 1: print(f"{num}x + ", end = "")
#      else: print(f"{num}x**{k} + ", end = "")
#      k -= 1